app/controllers/posts_controller.rb

  def show
    @post=Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id:params[:id]).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 10]]

  def destroy
  @post = Post.find_by(id: params[:id])
  if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 9]]