app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?)  [["name", "ねこ"], ["email", "nekoneko@progate.com"], ["created_at", "2021-09-20 04:17:38.925766"], ["updated_at", "2021-09-20 04:17:38.925766"], ["image_name", "default_user.png"]]
---
def create
 @user = User.new(name:params[:name], email: params[:email],
 image_name:"default_user.png",password: params[:password])
 if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "2.jpg"], ["updated_at", "2021-09-20 05:10:51.131353"], ["id", 2]]
---
def update
  @user = User.find_by(id: params[:id])
  @user.name= params[:name]
  @user.email= params[:email]
  if params[:image]
    @user.image_name= "#{@user.id}.jpg"
    image = params[:image]
    File.binwrite("public/user_images/#{@user.image_name}",image.read)
  end

  if @user.save